Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM144.atdf
         <interrupt caption="SPI5 Receive Done" index="177" module-instance="SPI5_RX" name="SPI5_RX"/>
         <interrupt caption="SPI5 Transmit Done" index="178" module-instance="SPI5_TX" name="SPI5_TX"/>
         <interrupt caption="UART5 Fault" index="179" module-instance="UART5_FAULT" name="UART5_FAULT"/>
         <interrupt caption="UART5 Receive Done" index="180" module-instance="UART5_RX" name="UART5_RX"/>
         <interrupt caption="UART5 Transmit Done" index="181" module-instance="UART5_TX" name="UART5_TX"/>
         <interrupt caption="I2C5 Bus Collision Event" index="182" module-instance="I2C5_BUS" name="I2C5_BUS"/>
         <interrupt caption="I2C5 Slave Event" index="183" module-instance="I2C5_SLAVE" name="I2C5_SLAVE"/>
         <interrupt caption="I2C5 Master Event" index="184" module-instance="I2C5_MASTER" name="I2C5_MASTER"/>
         <interrupt caption="SPI6 Fault" index="185" module-instance="SPI6_FAULT" name="SPI6_FAULT"/>
         <interrupt caption="SPI6 Receive Done" index="186" module-instance="SPI6_RX" name="SPI6_RX"/>
         <interrupt caption="SPI6 Transmit Done" index="187" module-instance="SPI6_TX" name="SPI6_TX"/>
         <interrupt caption="UART6 Fault" index="188" module-instance="UART6_FAULT" name="UART6_FAULT"/>
         <interrupt caption="UART6 Receive Done" index="189" module-instance="UART6_RX" name="UART6_RX"/>
         <interrupt caption="UART6 Transmit Done" index="190" module-instance="UART6_TX" name="UART6_TX"/>
         <interrupt caption="ADC End of Scan Ready" index="192" name="ADC_EOS"/>
         <interrupt caption="ADC Analog Circuits Ready" index="193" name="ADC_ARDY"/>
         <interrupt caption="ADC Update Ready" index="194" name="ADC_URDY"/>
         <interrupt caption="ADC Group Early Interrupt Request" index="196" name="ADC_EARLY"/>
         <interrupt caption="ADC0 Early Interrupt Request" index="198" module-instance="ADC0_EARLY" name="ADC0_EARLY"/>
         <interrupt caption="ADC1 Early Interrupt Request" index="199" module-instance="ADC1_EARLY" name="ADC1_EARLY"/>
         <interrupt caption="ADC2 Early Interrupt Request" index="200" module-instance="ADC2_EARLY" name="ADC2_EARLY"/>
         <interrupt caption="ADC3 Early Interrupt Request" index="201" module-instance="ADC3_EARLY" name="ADC3_EARLY"/>
         <interrupt caption="ADC4 Early Interrupt Request" index="202" module-instance="ADC4_EARLY" name="ADC4_EARLY"/>
         <interrupt caption="ADC7 Early Interrupt Request" index="205" module-instance="ADC7_EARLY" name="ADC7_EARLY"/>
         <interrupt caption="ADC0 Warm Interrupt Request" index="206" module-instance="ADC0_WARM" name="ADC0_WARM"/>
         <interrupt caption="ADC1 Warm Interrupt Request" index="207" module-instance="ADC1_WARM" name="ADC1_WARM"/>
         <interrupt caption="ADC2 Warm Interrupt Request" index="208" module-instance="ADC2_WARM" name="ADC2_WARM"/>
         <interrupt caption="ADC3 Warm Interrupt Request" index="209" module-instance="ADC3_WARM" name="ADC3_WARM"/>
         <interrupt caption="ADC4 Warm Interrupt Request" index="210" module-instance="ADC4_WARM" name="ADC4_WARM"/>
         <interrupt caption="ADC7 Warm Interrupt Request" index="213" module-instance="ADC7_WARM" name="ADC7_WARM"/>
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag"/>
         <interface name="SWD" type="swd"/>
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" name="DEVCFG3" initval="0xFFFFFFFF">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID"/>
            <bitfield caption="Ethernet MII Enable Configuration bit" mask="0x1000000" name="FMIIEN" values="DEVCFG3__FMIIEN"/>
            <bitfield caption="Ethernet I/O Pin Selection Configuration bit" mask="0x2000000" name="FETHIO" values="DEVCFG3__FETHIO"/>
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY"/>
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY"/>
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY"/>
            <bitfield caption="USB USBID Selection bit" mask="0x40000000" name="FUSBIDIO" values="DEVCFG3__FUSBIDIO"/>
         </register>
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xFFF9B198">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV"/>
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG"/>
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK"/>
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT"/>
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV"/>
            <bitfield caption="USB PLL Input Frequency Select bit" mask="0x40000000" name="UPLLFSEL" values="DEVCFG2__UPLLFSEL"/>
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FF39">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC"/>
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV"/>
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN"/>
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO"/>
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD"/>
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC"/>
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM"/>
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS"/>
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM"/>
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS"/>
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN"/>
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ"/>
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT"/>
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000L" name="FDMTEN" values="DEVCFG1__FDMTEN"/>
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0xFFFFF7DB">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG"/>
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN"/>
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL"/>
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN"/>
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA"/>
            <bitfield caption="Dynamic Flash ECC Configuration bits" mask="0x300" name="FECCCON" values="DEVCFG0__FECCCON"/>
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP"/>
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER"/>
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR"/>
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN"/>
            <bitfield caption="Secondary Oscillator Boost Kick Start Enable bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST"/>
            <bitfield caption="Primary Oscillator Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN"/>
            <bitfield caption="Primary Oscillator Boost Kick Start Enable bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST"/>
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN"/>
         </register>
         <register caption="Device Code-Protect 0 Register" name="DEVCP0" initval="0xFFFFFFFF">
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCP0__CP"/>
         </register>
