Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM144.atdf
      <value-group caption="Select Memory Type for Chip Select 'x' bits" name="EBIMSK1__MEMTYPE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="NOR-Flash" name="" value="0x2"/>
         <value caption="SRAM" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timing Register Set for Chip Select 'x' bits" name="EBIMSK1__REGSEL">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Use EBISMT2" name="" value="0x2"/>
         <value caption="Use EBISMT1" name="" value="0x1"/>
         <value caption="Use EBISMT0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Size for Chip Select 'x' bits" name="EBIMSK2__MEMSIZE">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="16 MB" name="" value="0x9"/>
         <value caption="8 MB" name="" value="0x8"/>
         <value caption="4 MB" name="" value="0x7"/>
         <value caption="2 MB" name="" value="0x6"/>
         <value caption="1 MB" name="" value="0x5"/>
         <value caption="512 KB" name="" value="0x4"/>
         <value caption="256 KB" name="" value="0x3"/>
         <value caption="128 KB" name="" value="0x2"/>
         <value caption="64 KB (smaller memories alias within this range)" name="" value="0x1"/>
         <value caption="Chip Select is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Type for Chip Select 'x' bits" name="EBIMSK2__MEMTYPE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="NOR-Flash" name="" value="0x2"/>
         <value caption="SRAM" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timing Register Set for Chip Select 'x' bits" name="EBIMSK2__REGSEL">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Use EBISMT2" name="" value="0x2"/>
         <value caption="Use EBISMT1" name="" value="0x1"/>
         <value caption="Use EBISMT0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Size for Chip Select 'x' bits" name="EBIMSK3__MEMSIZE">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="16 MB" name="" value="0x9"/>
         <value caption="8 MB" name="" value="0x8"/>
         <value caption="4 MB" name="" value="0x7"/>
         <value caption="2 MB" name="" value="0x6"/>
         <value caption="1 MB" name="" value="0x5"/>
         <value caption="512 KB" name="" value="0x4"/>
         <value caption="256 KB" name="" value="0x3"/>
         <value caption="128 KB" name="" value="0x2"/>
         <value caption="64 KB (smaller memories alias within this range)" name="" value="0x1"/>
         <value caption="Chip Select is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Type for Chip Select 'x' bits" name="EBIMSK3__MEMTYPE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="NOR-Flash" name="" value="0x2"/>
         <value caption="SRAM" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timing Register Set for Chip Select 'x' bits" name="EBIMSK3__REGSEL">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Use EBISMT2" name="" value="0x2"/>
         <value caption="Use EBISMT1" name="" value="0x1"/>
         <value caption="Use EBISMT0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Memory Device Page Mode Support bit" name="EBISMT0__PAGEMODE">
         <value caption="Device supports Page mode" name="" value="0x1"/>
         <value caption="Device does not support Page mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Page Size for Page Mode Device bits" name="EBISMT0__PAGESIZE">
         <value caption="32-word page" name="" value="0x3"/>
         <value caption="16-word page" name="" value="0x2"/>
         <value caption="8-word page" name="" value="0x1"/>
         <value caption="4-word page" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Ready Device Select bit" name="EBISMT0__RDYMODE">
         <value caption="EBIRDYx input is used" name="" value="0x1"/>
         <value caption="EBIRDYx input is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Memory Device Page Mode Support bit" name="EBISMT1__PAGEMODE">
         <value caption="Device supports Page mode" name="" value="0x1"/>
         <value caption="Device does not support Page mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Page Size for Page Mode Device bits" name="EBISMT1__PAGESIZE">
         <value caption="32-word page" name="" value="0x3"/>
         <value caption="16-word page" name="" value="0x2"/>
         <value caption="8-word page" name="" value="0x1"/>
         <value caption="4-word page" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Ready Device Select bit" name="EBISMT1__RDYMODE">
         <value caption="EBIRDYx input is used" name="" value="0x1"/>
         <value caption="EBIRDYx input is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Memory Device Page Mode Support bit" name="EBISMT2__PAGEMODE">
         <value caption="Device supports Page mode" name="" value="0x1"/>
         <value caption="Device does not support Page mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Page Size for Page Mode Device bits" name="EBISMT2__PAGESIZE">
         <value caption="32-word page" name="" value="0x3"/>
         <value caption="16-word page" name="" value="0x2"/>
         <value caption="8-word page" name="" value="0x1"/>
         <value caption="4-word page" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Ready Device Select bit" name="EBISMT2__RDYMODE">
         <value caption="EBIRDYx input is used" name="" value="0x1"/>
         <value caption="EBIRDYx input is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Reset/Power-down mode Select bit" name="EBISMCON__SMRP">
         <value caption="Flash is taken out of Power-down mode" name="" value="0x1"/>
         <value caption="Flash is forced into Power-down mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Static Memory Width for Register EBISMT0 bits" name="EBISMCON__SMDWIDTH0">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="8 bits" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="16 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Static Memory Width for Register EBISMT1 bits" name="EBISMCON__SMDWIDTH1">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="8 bits" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="16 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Static Memory Width for Register EBISMT2 bits" name="EBISMCON__SMDWIDTH2">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="8 bits" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="16 bits" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="01114" name="ETH" version="1">
      <register-group name="ETH">
         <register caption="Ethernet Controller Control Register 1" name="ETHCON1" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="BUFCDEC"/>
            <bitfield caption="Manual Flow Control bit" mask="0x00000010" name="MANFC" values="ETHCON1__MANFC"/>
            <bitfield caption="Automatic Flow Control bit" mask="0x00000080" name="AUTOFC" values="ETHCON1__AUTOFC"/>
            <bitfield caption="Receive Enable bit" mask="0x00000100" name="RXEN" values="ETHCON1__RXEN"/>
            <bitfield caption="Transmit Request to Send bit" mask="0x00000200" name="TXRTS" values="ETHCON1__TXRTS"/>
            <bitfield caption="Ethernet Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ETHCON1__SIDL"/>
            <bitfield caption="Ethernet ON bit" mask="0x00008000" name="ON" values="ETHCON1__ON"/>
            <bitfield mask="0xFFFF0000" name="PTV"/>
         </register>
         <register caption="Ethernet Controller Control Register 2" name="ETHCON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="RX Data Buffer Size for All RX Descriptors bits" mask="0x000007F0" name="RXBUFSZ" values="ETHCON2__RXBUFSZ"/>
         </register>
