Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM144.atdf
      <value-group caption="UARTx Loopback Mode Select bit" name="U6MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1"/>
         <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U6MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1"/>
         <value caption="Wake-up is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bits" name="U6MODE__UEN">
         <value caption="UxTX" name="" value="0x3"/>
         <value caption="UxTX" name="" value="0x2"/>
         <value caption="UxTX" name="" value="0x1"/>
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U6MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U6MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1"/>
         <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U6MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U6MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Data Available bit" name="U1STA__URXDA">
         <value caption="Receive buffer has data, at least one more character can be read" name="" value="0x1"/>
         <value caption="Receive buffer is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit." name="U1STA__OERR">
         <value caption="Receive buffer has overflowed" name="" value="0x1"/>
         <value caption="Receive buffer has not overflowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Framing Error Status bit" name="U1STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1"/>
         <value caption="Framing error has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity Error Status bit" name="U1STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1"/>
         <value caption="Parity error has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Idle bit" name="U1STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1"/>
         <value caption="Data is being received" name="" value="0x0"/>
      </value-group>
      <value-group caption="Address Character Detect bit" name="U1STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1"/>
         <value caption="Address Detect mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U1STA__URXISEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2"/>
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1"/>
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="U1STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Enable bit" name="U1STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Break bit" name="U1STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1"/>
         <value caption="Break transmission is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Enable bit" name="U1STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U1STA__UTXINV">
         <value caption="(If IrDA mode is disabled (i.e." name="" value="0x1"/>
         <value caption="(If IrDA mode is disabled (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U1STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2"/>
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1"/>
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0"/>
      </value-group>
      <value-group caption="Automatic Address Detect Mode Enable bit" name="U1STA__ADM_EN">
         <value caption="Automatic Address Detect mode is enabled" name="" value="0x1"/>
         <value caption="Automatic Address Detect mode is disabled" name="" value="0x0"/>
      </value-group>
